[
    {
        "title":"sql.telemetry.mozilla.org",
        "url":"https://sql.telemetry.mozilla.org/",
        "description":"The sql.telemetry.mozilla.org (s.t.m.o) site is an instance of the very fine [redash](https://getredash.io/) software, allowing for SQL-based exploratory analysis and visualization / dashboard construction. Requires (surprise!) familiarity with SQL, and for your data to be explicitly exposed as an s.t.m.o data source. Bugs or feature requests can be reported in our [issue tracker](https://github.com/mozilla/redash/issues)."
    },
    {
        "title":"analysis.telemetry.mozilla.org",
        "url":"https://analysis.telemetry.mozilla.org/",
        "description":"The analysis.telemetry.mozilla.org (a.t.m.o) site can be used to launch and gain access to virtual machines that are running an [Apache Spark](https://spark.apache.org/) cluster, preconfigured with access to the raw data stored in our long term storage (LTS) S3 buckets. Spark allows you to use Python or Scala to perform arbitrary analysis and generate arbitrary output. Once developed, a.t.m.o can also be used to run recurring Spark jobs for data transformation, processing, or reporting. Requires Python or Scala programming skills and knowledge of various data APIs. Learn more by visiting the [documentation](https://wiki.mozilla.org/Telemetry) or [tutorials](https://wiki.mozilla.org/Telemetry/Custom_analysis_with_spark)."
    },
    {
        "title":"Distribution Viewer",
        "url":"https://gauss.telemetry.mozilla.org/",
        "description":"Distribution Viewer is a simple tool that provides a set of [cumulative distribution](http://math.stackexchange.com/questions/52400/what-is-cdf-cumulative-distribution-function) graphs for a pre-specified selection of Firefox-related metrics from a 1% sample of clientIds from Unified Telemetry. These plots will allow you to understand how values of different metrics are spread out among our population of users rather than just using a one number summary (such as a mean or median). By viewing the entire distribution, you can get a sense of the importance of behavior at the extremes as well as anomalies within the population that might indicate interesting behavior. Very simple to use (no programming required) and able to provide interesting insights, but not usually suitable for ad-hoc analysis."
    },
    {
        "title":"telemetry.mozilla.org",
        "url":"https://telemetry.mozilla.org/",
        "description":"Our telemetry.mozilla.org (t.m.o) site is the 'venerable standby' of the Firefox telemetry analysis tools. It uses aggregate telemetry data (as opposed to the collated data sets that are exposed to most of the other tools) so it provides less latency than most but is unsuitable for examining at the individual client level. It provides a powerful UI that allows for sophisticated ad-hoc analysis without the need for any specialized programming skills, but with so many options the UI can be a bit intimidating for novice users."
    },
    {
        "title":"Real Time / CEP",
        "url":"https://pipeline-cep.prod.mozaws.net/",
        "description":"The 'real time' or 'complex event processing' (CEP) system is part of the ingestion infrastructure that processes all of our Firefox telemetry data. It provides extremely low latency access to the data as it's flowing through our ingestion system on its way to long term storage. As a CEP system, it is unlike the rest of our analysis tools in that it is up to the analyst to specify and maintain state from the data that is flowing; it is non-trivial to revisit older data that has already passed through the system. The CEP is very powerful, allowing for sophisticated monitoring, alerting, reporting, and dashboarding. Developing new analysis modules (called 'filters') requires knowledge of the Lua programming language, relevant APIs, and a custom filter configuration syntax."
    }
]
